app/controllers/tableros_controller.rb

INSERT INTO "tableros" ("state", "game_end", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["state", nil], ["game_end", nil], ["created_at", "2023-09-13 19:02:27.298569"], ["updated_at", "2023-09-13 19:02:27.298569"]]
SELECT "tableros".* FROM "tableros" ORDER BY "tableros"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "tableros" ("state", "game_end", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["state", nil], ["game_end", nil], ["created_at", "2023-09-13 19:06:36.547738"], ["updated_at", "2023-09-13 19:06:36.547738"]]
UPDATE "tableros" SET "state" = ?, "game_end" = ?, "updated_at" = ? WHERE "tableros"."id" = ?  [["state", "[[0,1,1],[1,0,0],[0,0,1]]"], ["game_end", 0], ["updated_at", "2023-09-13 19:02:27.316776"], ["id", 1]]
---
  def show
    @tablero = Tablero.last || Tablero.create
    unless @tablero.state
      @tablero.inicializar
      @tablero.save

SELECT "tableros".* FROM "tableros" ORDER BY "tableros"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "tableros" SET "state" = ?, "game_end" = ?, "updated_at" = ? WHERE "tableros"."id" = ?  [["state", "[[0,1,0],[0,0,1],[0,0,0]]"], ["game_end", 1], ["updated_at", "2023-09-13 19:02:48.977265"], ["id", 1]]
---
  def update
    @tablero = Tablero.last
    @tablero.aplicar_reglas
    @tablero.save

INSERT INTO "tableros" ("state", "game_end", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["state", nil], ["game_end", 0], ["created_at", "2023-09-13 19:14:26.290558"], ["updated_at", "2023-09-13 19:14:26.290558"]]
---
  def reset
    @tablero = Tablero.create